Repository: d0Sar/build360-ai-content-generator
Catalog: languages/build360-ai-*.po
Languages: el

source: Build360 AI Content Generator requires WooCommerce to be installed and active.
el: Το Build360 AI Content Generator απαιτεί την εγκατάσταση και ενεργοποίηση του WooCommerce.

source: Available Tokens:
el: Διαθέσιμα Tokens:

source: Generate Content For:
el: Δημιουργία Περιεχομένου Για:

source: Keywords (comma-separated):
el: Λέξεις-κλειδιά (διαχωρισμένες με κόμμα):

source: Add relevant keywords to help generate more focused content.
el: Προσθέστε σχετικές λέξεις-κλειδιά για να δημιουργήσετε πιο εστιασμένο περιεχόμενο.

source: e.g., modern, stylish, durable
el: π.χ., μοντέρνο, κομψό, ανθεκτικό

source: Generate Content
el: Δημιουργία Περιεχομένου

source: Generating...
el: Δημιουργία...

source: Success!
el: Επιτυχία!

source: Error:
el: Σφάλμα:

source: Are you sure you want to generate content for the selected products? This may overwrite existing content.
el: Είστε βέβαιοι ότι θέλετε να δημιουργήσετε περιεχόμενο για τα επιλεγμένα προϊόντα; Αυτό μπορεί να αντικαταστήσει το υπάρχον περιεχόμενο.

source: Product Description
el: Περιγραφή Προϊόντος

source: Short Description
el: Σύντομη Περιγραφή

source: Meta Title
el: Meta Τίτλος

source: Meta Description
el: Meta Περιγραφή

source: Image Alt Text
el: Εναλλακτικό Κείμενο Εικόνας

source: no_fields_selected
el: Δεν έχουν επιλεγεί πεδία

source: Short (100-150 chars)
el: Σύντομο (100-150 χαρακτήρες)

source: Good for titles, alt text
el: Κατάλληλο για τίτλους, εναλλακτικό κείμενο

source: Medium (200-300 chars)
el: Μεσαίο (200-300 χαρακτήρες)

source: Good for short descriptions, meta descriptions
el: Κατάλληλο για σύντομες περιγραφές, meta περιγραφές

source: Long (350+ chars)
el: Μεγάλο (350+ χαρακτήρες)

source: Good for full descriptions, blog content
el: Κατάλληλο για πλήρεις περιγραφές, περιεχόμενο ιστολογίου

source: The maximum number of characters for this content type.
el: Ο μέγιστος αριθμός χαρακτήρων για αυτόν τον τύπο περιεχομένου.

source: characters
el: χαρακτήρες

source: chars
el: χαρακτήρες

source: Recommended for short content like titles or alt text.
el: Συνιστάται για σύντομο περιεχόμενο όπως τίτλοι ή εναλλακτικό κείμενο.

source: Recommended for medium-length content like meta descriptions.
el: Συνιστάται για περιεχόμενο μεσαίου μήκους όπως meta περιγραφές.

source: Recommended for detailed content like full product descriptions.
el: Συνιστάται για λεπτομερές περιεχόμενο όπως πλήρεις περιγραφές προϊόντων.

source: Default: %d characters. %s
el: Προεπιλογή: %d χαρακτήρες. %s

source: Enter a valid value. The two closest valid values are 50 and 100.
el: Εισάγετε μια έγκυρη τιμή. Οι δύο πλησιέστερες έγκυρες τιμές είναι 50 και 100.
